{"config": [{"config": {"name": "lambda_1", "arguments": {}, "batch_input_shape": [null, 64, 64, 3], "function_type": "lambda", "trainable": true, "input_dtype": "float32", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-8-5a1748bbf1a7>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"name": "convolution2d_1", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 24, "b_constraint": null, "subsample": [2, 2], "W_regularizer": null, "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_col": 5, "activation": "relu", "border_mode": "valid", "W_constraint": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_2", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 36, "b_constraint": null, "subsample": [2, 2], "W_regularizer": null, "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_col": 5, "activation": "relu", "border_mode": "valid", "W_constraint": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "trainable": true, "border_mode": "valid", "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_3", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 48, "b_constraint": null, "subsample": [2, 2], "W_regularizer": null, "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_col": 5, "activation": "relu", "border_mode": "valid", "W_constraint": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "trainable": true, "border_mode": "valid", "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_4", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "b_constraint": null, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_col": 1, "activation": "relu", "border_mode": "valid", "W_constraint": null, "nb_row": 1}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"pool_size": [1, 1], "dim_ordering": "tf", "name": "maxpooling2d_3", "trainable": true, "border_mode": "valid", "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_5", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "b_constraint": null, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_col": 3, "activation": "relu", "border_mode": "valid", "W_constraint": null, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"pool_size": [1, 1], "dim_ordering": "tf", "name": "maxpooling2d_4", "trainable": true, "border_mode": "valid", "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 1164, "bias": true, "activation": "linear", "W_constraint": null, "input_dim": 64}, "class_name": "Dense"}, {"config": {"name": "dense_2", "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 100, "bias": true, "activation": "linear", "W_constraint": null, "input_dim": 1164}, "class_name": "Dense"}, {"config": {"name": "dense_3", "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 50, "bias": true, "activation": "linear", "W_constraint": null, "input_dim": 100}, "class_name": "Dense"}, {"config": {"name": "dense_4", "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 10, "bias": true, "activation": "linear", "W_constraint": null, "input_dim": 50}, "class_name": "Dense"}, {"config": {"name": "dense_5", "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 1, "bias": true, "activation": "linear", "W_constraint": null, "input_dim": 10}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}